Feature: Търсене на полет

  Scenario Outline: Търсене на полет
    Given Потребителя отваря екрана за търсене на полет
    When Въвежда заминаване от "<departure>"
    And Въвежда пристигане в "<destination>"
    And Въвежда дата на заминаване "<departureDate>"
    And Натиска бутона за търсене
    Then Вижда съобщението "<expectedMessage>"

    Examples: 
      | departure | destination | departureDate | expectedMessage                                  |
      | Рим       | Берлин      | 2021-07-01    | Резултатите от вашето търсене са:                |
      | Рим       | Берлин      | 2021-07-21    | Няма открити резултати от вашето търсене         |
      | Рим       | Берлин      | 2021/11/15    | Моля въведете коректен формат на дата!           |
      | Рим       | Берлн       | 2021-07-01    | Моля въведете коректна дестинация на пристигане! |
      |           | Берлин      | 2021-07-01    | Моля въведете дестинация на заминаване!          |
